       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. PYMBLE-SOFTWARE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "HELLO, WORLD!".
           DISPLAY "RUNNING ON CP/M WITH COBOL".
           STOP RUN.
